[
    "The Manhattan Project was not intended to create nuclear weapons, it was meant to recreate the destructive power in a Chuck Norris Roundhouse Kick. They didn't even come close.",
    "Chuck Norris has banned rainbows from the state of North Dakota.",
    "Divide Chuck Norris by zero and you will in fact get one........one bad-ass, that is.",
    "TNT was originally developed by Chuck Norris to cure indigestion.",
    "After returning from World War II unscathed, Bob Dole was congratulated by Chuck Norris with a handshake. The rest is history.",
    "Chuck Norris runs on batteries. Specifically, Die Hards.",
    "\"Let the Bodies Hit the Floor\" was originally written as Chuck Norris' theme song.",
    "Chuck Norris will never have a heart attack. His heart isn't nearly foolish enough to attack him.",
    "Only Chuck Norris can prevent forest fires.",
    "When Chuck Norris makes a burrito, its main ingredient is real toes.",
    "Chuck Norris is not Irish. His hair is soaked in the blood of his victims.",
    "In the movie \"The Matrix\", Chuck Norris is the Matrix. If you pay close attention in the green \"falling code\" scenes, you can make out the faint texture of his beard.",
    "They say curiosity killed the cat. This is false. Chuck Norris killed the cat. Every single one of them.",
    "There is no such thing as a lesbian, just a woman who has never met Chuck Norris.",
    "Chuck Norris crossed the road. No one has ever dared question his motives.",
    "One time, at band camp, Chuck Norris ate a percussionist.",
    "Chuck Norris doesn't say \"who's your daddy\", because he knows the answer.",
    "Chuck Norris originally wrote the first dictionary. The definition for each word is: A swift roundhouse kick to the face.",
    "Love does not hurt. Chuck Norris does.",
    "Chuck Norris once round-house kicked a salesman. Over the phone.",
    "The pen is mightier than the sword, but only if the pen is held by Chuck Norris.",
    "Chuck Norris knows the last digit of pi.",
    "Those aren't credits that roll after Walker Texas Ranger. It is actually a list of fatalities that occurred during the making of the episode.",
    "The air around Chuck Norris is always a balmy 78 degrees.",
    "When Chuck Norris wants an egg, he cracks open a chicken.",
    "Chuck Norris plays racquetball with a waffle iron and a bowling ball.",
    "Chuck Norris doesn't believe in ravioli. He stuffs a live turtle with beef and smothers it in pig's blood.",
    "Count from one to ten. That's how long it would take Chuck Norris to kill you...Forty seven times.",
    "The 1972 Miami Dolphins lost one game, it was a game vs. Chuck Norris and three seven year old girls. Chuck Norris won with a roundhouse-kick to the face in overtime.",
    "Chuck Norris is not Politically Correct. He is just Correct. Always.",
    "Mr. T pities the fool. Chuck Norris rips the fool's head off.",
    "Chuck Norris had to stop washing his clothes in the ocean. The tsunamis were killing people.",
    "A man once taunted Chuck Norris with a bag of Lay's potato chips, saying \"Betcha can't eat just one!\" Chuck Norris proceeded to eat the chips, the bag, and the man in one deft move.",
    "Chuck Norris' favorite cereal is Kellogg's Nails 'N' Gravel.",
    "In the first Jurassic Park movie, the Tyrannosaurus Rex wasn't chasing the jeep. Chuck Norris was chasing the Tyrannosaurus AND the jeep.",
    "Chuck Norris has never been accused of murder because his roundhouse kicks are recognized as \"acts of God.\"",
    "Rules of fighting: 1) Don't bring a knife to a gun fight. 2) Don't bring a gun to a Chuck Norris fight.",
    "Chuck Norris is the only man who has, literally, beaten the odds. With his fists.",
    "In ancient China there is a legend that one day a child will be born from a dragon, grow to be a man, and vanquish evil from the land. That man is not Chuck Norris, because Chuck Norris killed that man.",
    "When you play Monopoly with Chuck Norris, you do not pass go, and you do not collect two hundred dollars. You will be lucky if you make it out alive.",
    "Chuck Norris describes human beings as \"a sociable holder for blood and guts\".",
    "Chuck Norris likes his ice like he likes his skulls: crushed.",
    "Chuck Norris can kick through all 6 degrees of separation, hitting anyone, anywhere, in the face, at any time.",
    "Chuck Norris does all of his grocery shopping at Home Depot.",
    "Everything King Midas touched turnes to gold. Everything Chuck Norris touches turns up dead.",
    "When Chuck Norris throws exceptions, it's across the room.",
    "All arrays Chuck Norris declares are of infinite size, because Chuck Norris knows no bounds.",
    "Chuck Norris doesn't have disk latency because the hard drive knows to hurry the hell up.",
    "Chuck Norris writes code that optimizes itself.",
    "Chuck Norris can't test for equality because he has no equal.",
    "Chuck Norris doesn't need garbage collection because he doesn't call .Dispose(), he calls .DropKick().",
    "Chuck Norris's first program was kill -9.",
    "Chuck Norris burst the dot com bubble.",
    "All browsers support the hex definitions #chuck and #norris for the colors black and blue.",
    "MySpace actually isn't your space, it's Chuck's (he just lets you use it).",
    "Chuck Norris can write infinite recursion functions and have them return.",
    "Chuck Norris can solve the Towers of Hanoi in one move.",
    "The only pattern Chuck Norris knows is God Object.",
    "Chuck Norris finished World of Warcraft.",
    "Project managers never ask Chuck Norris for estimations... ever.",
    "Chuck Norris doesn't use web standards as the web will conform to him.",
    "\"It works on my machine\" always holds true for Chuck Norris.",
    "Whiteboards are white because Chuck Norris scared them that way.",
    "Chuck Norris doesn't do Burn Down charts, he does Smack Down charts.",
    "Chuck Norris can delete the Recycling Bin.",
    "Chuck Norris's beard can type 140 wpm.",
    "Chuck Norris can unit test entire applications with a single assert.",
    "Chuck Norris doesn't bug hunt as that signifies a probability of failure, he goes bug killing.",
    "Chuck Norris's keyboard doesn't have a Ctrl key because nothing controls Chuck Norris.",
    "When Chuck Norris is web surfing websites get the message \"Warning: Internet Explorer has deemed this user to be malicious or dangerous. Proceed?\".",
    "Chuck Norris can overflow your stack just by looking at it.",
    "To Chuck Norris, everything contains a vulnerability.",
    "Chuck Norris doesn't need sudo, he just types \"Chuck Norris\" before his commands.",
    "Chuck Norris doesn't need a debugger, he just stares down the bug until the code confesses.",
    "Chuck Norris can access private methods.",
    "Chuck Norris can instantiate an abstract class.",
    "Chuck Norris does not need to know about class factory pattern. He can instantiate interfaces.",
    "The class object inherits from Chuck Norris",
    "For Chuck Norris, NP-Hard = O(1).",
    "Bill Gates thinks he's Chuck Norris. Chuck Norris actually laughed. Once.",
    "Chuck Norris' Internet connection is faster upstream than downstream because even data has more incentive to run from him than to him.",
    "Chuck Norris solved the Travelling Salesman problem in O(1) time. Here's the pseudo-code: Break salesman into N pieces. Kick each piece to a different city.",
    "No statement can catch the ChuckNorrisException.",
    "Chuck Norris doesn't pair program.",
    "Chuck Norris can write multi-threaded applications with a single thread.",
    "Chuck Norris doesn't need to use AJAX because pages are too afraid to postback anyways.",
    "Chuck Norris doesn't use reflection, reflection asks politely for his help.",
    "There is no Esc key on Chuck Norris' keyboard, because no one escapes Chuck Norris.",
    "Chuck Norris can binary search unsorted data.",
    "Chuck Norris breaks RSA 128-bit encrypted codes in milliseconds.",
    "Chuck Norris doesn't needs try-catch, exceptions are too afraid to raise.",
    "Chuck Norris went out of an infinite loop.",
    "If Chuck Norris writes code with bugs, the bugs fix themselves.",
    "Chuck Norris hosting is 101% uptime guaranteed.",
    "Chuck Norris's keyboard has the Any key.",
    "Chuck Norris can access the DB from the UI.",
    "Chuck Norris' programs never exit, they terminate.",
    "Chuck Norris insists on strongly-typed programming languages.",
    "Chuck Norris protocol design method has no status, requests or responses, only commands.",
    "Chuck Norris programs occupy 150% of CPU, even when they are not executing.",
    "Chuck Norris can spawn threads that complete before they are started.",
    "Chuck Norris programs do not accept input.",
    "Chuck Norris can install iTunes without installing Quicktime.",
    "Chuck Norris doesn't need an OS.",
    "Chuck Norris's OSI network model has only one layer - Physical.",
    "Chuck Norris can compile syntax errors.",
    "Every SQL statement that Chuck Norris codes has an implicit \"COMMIT\" in its end.",
    "Chuck Norris does not need to type-cast. The Chuck-Norris Compiler (CNC) sees through things. All way down. Always.",
    "Chuck Norris does not code in cycles, he codes in strikes.",
    "Chuck Norris doesn't use a computer because a computer does everything slower than Chuck Norris.",
    "Chuck Norris compresses his files by doing a flying round house kick to the hard drive.",
    "Chuck Norris solved the halting problem.",
    "Chuck Norris doesn't cheat death. He wins fair and square.",
    "Chuck Norris once won a game of connect four in 3 moves.",
    "With Chuck Norris P = NP. There's no nondeterminism with Chuck Norris decisions.",
    "Chuck Norris can do a wheelie on a unicycle.",
    "Chuck Norris can win in a game of Russian roulette with a fully loaded gun.",
    "Chuck Norris eats lightning and poops out thunder.",
    "Chuck Norris can retrieve anything from /dev/null.",
    "No one has ever pair-programmed with Chuck Norris and lived to tell about it.",
    "No one has ever spoken during review of Chuck Norris' code and lived to tell about it.",
    "Chuck Norris doesn't use GUI, he prefers COMMAND line.",
    "Chuck Norris doesn't use Oracle, he is the Oracle.",
    "Chuck Norris can dereference NULL.",
    "Jesus can walk on water, but Chuck Norris can swim through land.",
    "A diff between your code and Chuck Norris's is infinite.",
    "The Chuck Norris Eclipse plugin made alien contact.",
    "Chuck Norris is the ultimate mutex, all threads fear him.",
    "Chuck Norris uses canvas in IE.",
    "Don't worry about tests, Chuck Norris's test cases cover your code too.",
    "Each hair in Chuck Norris's beard contributes to make the world's largest DDOS.",
    "Chuck Norris's log statements are always at the FATAL level.",
    "Chuck Norris's database has only one table, 'Kick', which he DROPs frequently.",
    "When Chuck Norris break the build, you can't fix it, because there is not a single line of code left.",
    "Chuck Norris types with one finger. He points it at the keyboard and the keyboard does the rest.",
    "Chuck Norris's programs can pass the Turing Test by staring at the interrogator.",
    "If you try to kill -9 Chuck Norris's programs, it backfires.",
    "Chuck Norris's brain waves are suspected to be harmful to cell phones.",
    "Chuck Norris does infinite loops in 4 seconds.",
    "Product Owners never ask Chuck Norris for more features. They ask for mercy.",
    "Product Owners never argue with Chuck Norris after he demonstrates the DropKick feature.",
    "Chuck Norris killed two stones with one bird.",
    "Chuck Norris can speak Braille.",
    "Chuck Norris can over-write a locked variable.",
    "Chuck Norris knows the value of NULL, and he can sort by it too.",
    "Chuck Norris can install a 64 bit OS on 32 bit machines.",
    "Chuck Norris can write to an output stream.",
    "Chuck Norris can read from an input stream.",
    "Chuck Norris never has to build his program to machine code. Machines have learnt to interpret Chuck Norris code.",
    "Chuck Norris' unit tests don't run. They die.",
    "Chuck Norris sits at the stand-up.",
    "Chuck Norris doesn't need an account. He just logs in.",
    "How many Chuck Norris require to screw a light bulb? None, he will screw it all.",
    "Chuck Norris causes the Windows Blue Screen of Death.",
    "Chuck Norris can download emails with his pick-up.",
    "Chuck Norris can make a class that is both abstract and final.",
    "Chuck Norris could use anything in java.util.* to kill you, including the javadocs.",
    "Code runs faster when Chuck Norris watches it.",
    "Only Chuck Norris shuts down websites without due process, not SOPA or PIPA.",
    "Chuck Norris does not need a watch, he decides what time it is.",
    "Chuck Norris already went to Moon and Mars, that's why there are no signs of life.",
    "Once a police officer caught Chuck Norris, the cop was lucky enough to escape with a warning.",
    "Chuck Norris knows Victoria's secret.",
    "Dark spots on the Moon are the result of Chuck Norris' shooting practice.",
    "Chuck Norris died 20 years ago, Death doesn't have the courage to tell him yet.",
    "There is no April 1st in Chuck Norris' calendar, because no one can fool him.",
    "Chuck Norris can make onions cry.",
    "Chuck Norris can watch the radio.",
    "Chuck Norris built the hospital he was born in.",
    "Once Chuck Norris signed a cheque and the bank bounced.",
    "Chuck Norris can drown a fish.",
    "Once death had a near Chuck Norris experience.",
    "Once Chuck Norris and Superman had a competition. The loser had to wear his underwear over his pants.",
    "Chuck Norris can make fire using two ice cubes.",
    "Chuck Norris tears can cure the cancer, but the sad thing is Chuck Norris never cries.",
    "Chuck Norris can remember the future.",
    "Chuck Norris doesn't age, because time cannot keep up with him.",
    "Ghosts are actually caused by Chuck Norris killing people faster than Death can process them.",
    "Chuck Norris understands every definition in the Oxford Thesaurus, except one - \"mercy\".",
    "Chuck Norris doesn't need a keyboard. He tells the computer to write something and it does.",
    "Chuck Norris once built a semi truck. That truck is now known as Optimus Prime.",
    "Chuck Norris plays pool with comets and astroids. He shoots them into black holes.",
    "There was never anything wrong with Achilles' heel until he got mad and decided to kick Chuck Norris.",
    "Did you know that Chuck Norris was in every Star Wars movie? He was \"The Force\".",
    "Knock knock, who's there? Chuck Norris! Chuck Norris who? Sorry, joke is over when Chuck Norris gets involved!",
    "Chuck Norris doesn't win, he allows you to lose.",
    "Tornados occur when Chuck Norris sneezes.",
    "Chuck Norris once sold eBay to eBay on eBay.",
    "Chuck Norris can build a snowman out of rain.",
    "Chuck Norris made the sun by rubbing his hands together.",
    "Chuck Norris doesn't turn on his faucet, he stares at it until it cries.",
    "Chuck Norris puts sunglasses on to protect the sun from his eyes.",
    "Chuck Norris can lock a safe and keep the key inside it."
]
